# SupportActivation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalService..::..SupportActivation Property
ExternalService Class See Also
---
Indicates if the service supports activation/deactivation of the servers.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool SupportActivation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SupportActivation As Boolean
	Get
```

Visual C++
---
```text
public:
property bool SupportActivation {
	bool get ();
}
```

# Remarks
If this option is set to false, for a single-server only one added(registered) will be considered active. In case of a multi-server service multiple servers cand be added(registered) and all of them will be considered to be active.
An attempt to change the activation state of the servers will lead to an exception.
# See Also
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace